anachrocomputer/PIC32GC/PIC32GameCube.X/GameCube.c
static void SPI3_begin(const int baud)
{    
    /* Configure SPI3 */
    // SCK3 on pin 39, RF13, P1 pin 15
    SDI3Rbits.SDI3R = 0;   // SDI3 on RPD2, pin 77
    RPG8Rbits.RPG8R = 14;  // SDO3 on RPG8, pin 12, P1 pin 28
    
    SPI3BRG = (20000000 / baud) - 1;
    SPI3CONbits.MSTEN = 1;  // Master mode
    SPI3CONbits.MODE16 = 0; // 8-bit mode
    SPI3CONbits.MODE32 = 0;
    SPI3CONbits.CKE = 1;
    SPI3CONbits.STXISEL = 0; // Interrupt on Tx complete
    SPI3CONbits.SRXISEL = 3; // Interrupt on Rx full
    
    TRISAbits.TRISA0 = 0;   // RA0 pin 17, P1 pin 24 as output for SS
    LATASET = _LATA_LATA0_MASK;   // De-assert SS for SPI3
    
    IPC12bits.SPI3IP = 4;          // SPI3 interrupt priority 4
    IPC12bits.SPI3IS = 1;          // SPI3 interrupt sub-priority 1
    IFS2CLR = _IFS2_SPI3TXIF_MASK;  // Clear SPI3 Tx interrupt flag
    IFS2CLR = _IFS2_SPI3RXIF_MASK;  // Clear SPI3 Rx interrupt flag
    
    SPINbytes = 0;
    SPIDummyReads = 0;
    SPIBuf = NULL;
    
    SPI3CONbits.ON = 1;
}


bool SPIwrite(uint8_t *buf, const int nbytes)
{
    if (SPIDummyReads != 0)     // SPI tranmission still in progress?
    {
        return (false);
    }
    
    if ((nbytes <= 0) || (buf == NULL))
    {
        return (false);
    }
    
    LATACLR = _LATA_LATA0_MASK;   // Assert SS for SPI3
    
    SPIBuf = buf;
    SPINbytes = nbytes;
    SPIDummyReads = nbytes;
    
    SPI3BUF = *SPIBuf++;          // Transmit first byte
    SPINbytes--;
    
    IFS2CLR = _IFS2_SPI3RXIF_MASK;  // Clear SPI3 Rx interrupt flag
    IEC2SET = _IEC2_SPI3RXIE_MASK;  // Enable SPI3 Rx interrupt
    
    if (SPINbytes > 0)
    {
        IFS2CLR = _IFS2_SPI3TXIF_MASK;  // Clear SPI3 Tx interrupt flag
        IEC2SET = _IEC2_SPI3TXIE_MASK;  // Enable SPI3 Tx interrupt
    }
    
    return (true);
}

int SPIbytesPending(void)
{
    return (SPIDummyReads);
}


static void I2C1_begin(const int speed)
{
    if (speed > 200)
    {
        I2C1BRG = 0x2c;     // 400kHz
    }
    else
    {
        I2C1BRG = 0xc2;     // 100kHz
    }
    
    I2C1CONSET = _I2C1CON_ON_MASK;  // Enable I2C1
}


/* oledData --- send a data byte to the OLED by fast hardware SPI */

inline void oledData(const uint8_t d)
{
    static char data[2];
    
    while (SPIbytesPending() > 0)
        ;
    
    LATGbits.LATG9 = 1;  // DC HIGH
    
    data[0] = d;
    SPIwrite(data, 1);
}


/* oledCmd --- send a command byte to the OLED by fast hardware SPI */

inline void oledCmd(const uint8_t c)
{
    static char cmd[2];
    
    while (SPIbytesPending() > 0)
        ;
    
    LATGbits.LATG9 = 0;  // DC LOW
    
    cmd[0] = c;
    SPIwrite(cmd, 1);
}


/* oledCmd1b --- send two command bytes to the OLED by fast hardware SPI */

inline void oledCmd1b(const uint8_t c, const uint8_t b)
{
    static char cmd[2];
    
    while (SPIbytesPending() > 0)
        ;
    
    LATGbits.LATG9 = 0;  // DC LOW
    
    cmd[0] = c;
    cmd[1] = b;
    SPIwrite(cmd, 2);
}


/* updscreen --- update the physical screen from the buffer */

static void updscreen(void)
{
    static uint8_t addrCmd[] = {SSD1306_COLUMNADDR, 0, MAXX - 1, SSD1306_PAGEADDR, 4, 7};

    while (SPIbytesPending() > 0)
        ;
    
    LATGbits.LATG9 = 0;  // DC LOW
    
    SPIwrite(addrCmd, sizeof (addrCmd));
    
    while (SPIbytesPending() > 0)
        ;
    
    LATGbits.LATG9 = 1;  // DC HIGH
    
    SPIwrite(&Frame[0][0], MAXROWS * MAXX);
    
    while (SPIbytesPending() > 0)   // Wait for SPI transaction using 'Frame' to complete
        ;
}


/* OLED_begin --- initialise the SSD1306 OLED */

void OLED_begin(const int wd, const int ht)
{
    /* Configure I/O pins on PIC32 */
    TRISEbits.TRISE8 = 0;     // RE8, pin 18, P1 pin 22, as output for RES
    TRISGbits.TRISG9 = 0;     // RG9, pin 14, P1 pin 26, as output for DC

    LATEbits.LATE8 = 1;       // RES pin HIGH initially
    LATGbits.LATG9 = 1;       // DC pin HIGH initially

    /* Start configuring the SSD1306 OLED controller */
    delayms(1);
    LATEbits.LATE8 = 0;     // Hardware reset for 10ms
    delayms(10);
    LATEbits.LATE8 = 1;

    // Init sequence for SSD1306 128x64 or 128x32 OLED module
    oledCmd(SSD1306_DISPLAYOFF);                    // 0xAE
    oledCmd1b(SSD1306_SETDISPLAYCLOCKDIV, 0x80);    // 0xD5, the suggested ratio 0x80
    oledCmd1b(SSD1306_SETMULTIPLEX, 0x3F);          // 0xA8
    oledCmd1b(SSD1306_SETDISPLAYOFFSET, 0x00);      // 0xD3, no offset
    oledCmd(SSD1306_SETSTARTLINE | 0x0);            // line #0
    oledCmd1b(SSD1306_CHARGEPUMP, 0x14);            // 0x8D
    oledCmd1b(SSD1306_MEMORYMODE, 0x00);            // 0x20, 0x00 act like ks0108                                 // 
    oledCmd(SSD1306_SEGREMAP | 0x1);
    oledCmd(SSD1306_COMSCANDEC);
    
    if (ht < 64)
    {
        oledCmd1b(SSD1306_SETCOMPINS, 0x02);        // 0xDA
    }
    else
    {
        oledCmd1b(SSD1306_SETCOMPINS, 0x12);        // 0xDA
    }
    
    oledCmd1b(SSD1306_SETCONTRAST, 0xCF);           // 0x81
    oledCmd1b(SSD1306_SETPRECHARGE, 0xF1);          // 0xd9
    oledCmd1b(SSD1306_SETVCOMDETECT, 0x40);         // 0xDB
    oledCmd(SSD1306_DISPLAYALLON_RESUME);           // 0xA4
    oledCmd(SSD1306_NORMALDISPLAY);                 // 0xA6

    oledCmd(SSD1306_DISPLAYON); // Turn on OLED panel
}


/* greyFrame --- clear entire frame to checkerboard pattern */

void greyFrame(void)
{
    int r, c;

    for (r = 0; r < MAXROWS; r++)
    {
        for (c = 0; c < MAXX; c += 2)
        {
            Frame[r][c] = 0xaa;
            Frame[r][c + 1] = 0x55;
        }
    }
}


/* setPixel --- set a single pixel */

void setPixel(const unsigned int x, const unsigned int y)
{
    if ((x < MAXX) && (y < MAXY))
        Frame[y / 8][x] |= 1 << (y & 7);
    else
    {
//      Serial.print("setPixel(");
//      Serial.print(x);
//      Serial.print(",");
//      Serial.print(y);
//      Serial.println(")");
    }
}


/* clrPixel --- clear a single pixel */

void clrPixel(const unsigned int x, const unsigned int y)
{
    if ((x < MAXX) && (y < MAXY))
        Frame[y / 8][x] &= ~(1 << (y & 7));
    else
    {
//      Serial.print("clrPixel(");
//      Serial.print(x);
//      Serial.print(",");
//      Serial.print(y);
//      Serial.println(")");
    }
}


/* setVline --- draw vertical line */

void setVline(const unsigned int x, const unsigned int y1, const unsigned int y2)
{
    unsigned int y;

    for (y = y1; y <= y2; y++)
        setPixel(x, y);
}


/* clrVline --- draw vertical line */

void clrVline(const unsigned int x, const unsigned int y1, const unsigned int y2)
{
    unsigned int y;

    for (y = y1; y <= y2; y++)
        clrPixel(x, y);
}


